const puppeteer = require('puppeteer');
const cheerio = require('cheerio');
const fs = require('fs');


async function scrape(port, url) {
  const browser = await puppeteer.launch({
    args: ['--proxy-server=socks5://127.0.0.1:' + port]
  });

  const page = await browser.newPage();
  console.log(url + ' ' + port);
  let urlafter = url.replace(/ /g, '%20');
  const yandex = `https://yandex.ru/images/search?text=${urlafter}`;
  const encodedURI = encodeURI(yandex);
  await page.goto(encodedURI);
  const content = await page.content();
  
  const $ = cheerio.load(content);
  
  const photos = [];
  $('.serp-item img').slice(0, 5).each((i, el) => {
    const img = $(el);
    photos.push('\n"'+url+'":"'+img.attr('src')+'"');
  });

  browser.close();

  // console.log(photos);
  // if (photos == '') {
  //   fs.appendFileSync('links.json', ''); 
  // } else {
    fs.appendFileSync('links.json', `{\n"${url}":"${url}",${photos}\n},`); 
    return photos;
  // }
  
}

async function main() {
  /**
   * Номера SOCKS-портов Tor, заданные в файле torrc. 
   */
  const ports = [

    '9052',
    '9053',
    '9054',
    '9055',
    '9056',
    '9057',
    '9058',
    '9059',
    '9060',
    '9062'
  ];

  // for(let a = 0, b = 0; a < ports.length && b < porf.length; a++, b++) {
  //   console.log(ports[a % porf.length], porf[b]);
  // }
  // for (const [i, value] of porf.entries()) {
  //   console.log(ports[i % ports.length], value);
  // }

  const urls = [
    'Защелка APECS 5300-WC-AC',
    'Защелка магнитная Apecs 5800-M-G золото',
    'Защелка межк. "Apecs" 5600-P-AC медь пластик',
    'Защелка межк. "Apecs" 5600-P-AB бронза пластик',
    'цили75 Apecs RT-75  кл\верт(35[40C)-C ni',
    'Защелка межк. "Apecs" 5300-P- WC-G золото с фикс',
    'Защелка межкомнатная "Apecs" 5300-P-WC-AB бронза с фикс',
    'Защелка врезная LH 720-50 AB SN бронза SKIN на 70мм',
    'Защелка врезная LH 420-50 PN на 47мм',
    'Защелка врезная LH  720-45   СР хром  SKIN  на 70мм',
    'Замок межкомнатный под цилиндр Armadillo LH 25-50 CP BOX (хром) (аналог APECS 5300 под цилиндр)',
    'Защелка магнитная AVERS 5800-M-NIS матовый хром',
    'Защелка межк. S-Locked 5400 NIS сатин',
    'Защелка межк. S-Locked 5600 WC AB бронза',
    'Защелка межк. S-Locked 5600 WC G золото',
    'Защелка межк. "Avers" 5600 GRF графит',
    'Защелка межк. "Avers" 5400 GRF графит',
    'Защелка межк. S-Locked 5400 G золото',
    'Защелка межк. S-Locked 5600 WC AC медь',
    'Защелка межк. S-Locked 5600 WC NIS сатин',
    'Защёлка врезная Avers 5300-MC-WC-CR',
    'Защелка межк. "Avers" 5400 AC медь АНАЛОГ',
    'Защелка магнитная AVERS 5800-M-AC медь',
    'Защелка магнитная AVERS 5800-M-AB бронза',
    'Защелка магнитная AVERS 5800-M-G золото',
    'Защелка межк. S-Locked 5400 AB бронза',
    'Защелка механическая под цилиндр BUSSARE BUS 2085 GOLD',
    'Защелка механическая BUSSARE PLAST 50/70 GOLD',
    'Защелка межкомнатная с пл.язычком BUSSARE PLAST50/70 BLACK (5600 черная)',
    'Защелка механическая BUSSARE PLAST 50/70 ANT.BRONZE/COFFEE',
    'Защелка магнитная BUSSARE MAG 50/70 CHROME',
    'Защелка магнитная BUSSARE MAG 50/70 ANT.BRONZE/COFFEE',
    'Защелка межкомнатная с пл.язычком BUSSARE L6-45 PLAST BLACK (5400 черная)',
    'Защелка магнитная BUSSARE MAG 50/70 GOLD',
    'Защелка механическая BUSSARE PLAST 50/70 CHROME',
    'Защелка механическая BUSSARE PLAST 50/70 BLACK',
    'Защелка врезная KALE 251 WC (44mm) латунь',
    'Защелка врезная Kale  251/R (40 mm) (латунь)',
    'Замок магнитный Pallini PM 410 B BL, матовый черный',
    'Замок магнитный Pallini PM 410 B W, белый',
    'Защёлка сантехническая МАГНИТНАЯ A=96мм, бэксет 50 мм ХРОМ / РЕНЦ',
    'L5-45 защёлка межкомнатная Y=45mm полиров хром RENZ',
    'задвижка Apecs L-0126-  BN черн ник.',
    '101 Задвижка АС медь',
    'Чебоксары задвижка ЗГ-1-210',
    'Защелка Гардиан "SOFT 1 M" Ni никель',
    'Защелка врезная ОМЕГА ЗЩ2.03 медь',
    'Защелка Avers ЗЩ1-2-6 белый',
    'Защелка Кноб золото',
    'Завертка-ручка 2-сторонняя для теплиц пластик серый \цинк Металист',
    'Ручка д/пластик двери двойная с ключом',
    'Защелка балконная магнитная 13мм',
    'Ручка балконная белая (100)',
    'Замок блокирующий с тросиком',
    'Угольник выпуклый Уг 100 цинк',
    'Завертка форточная ЗФ-С белая',
    'Угольник выпуклый Уг 100 белый',
    'Ручка -скоба средняя РСК -128 тёмн дерево 604-А',
    'Завертка оконная РО-1 (Белая)',
    'Ручка оконная квадратная малая белая',
    'Ручка д/пластикового окна (100) белая',
    'Уголок маскитной сетки',
    'Угольник выпуклый Уг 75 цинк',
    'Завертка оконная РО-1 (бронза)',
    'Ручка -скоба средняя РСК -128 белая  604-А',
    'Завертка-ручка оконная Р1 цинк Металлист',
    'Защелка балконная ФАБРИКА ЗАМКОВ BL B большая сталь(200)',
    'Замок на раму блокирующий',
    'Ручка оконная квадратная малая дерево',
    'Ручка д/маскитной сетки',
    'Держатель д/маскитной сетки',
    'Ручка д/пластикового окна с ключом (100) белая',
    'Ручка д/пластик двери двойная',
    'Защелка балконная 9мм',
    'Угольник выпуклый Уг 50 цинк',
    'Завертка оконная РО-1 (антик.медь)',
    'Защелка балконная 13мм',
    'Ручка балконная белая металл',
    'Ограничитель д/пластикового окна (гребенка)',
    'Ручка-скоба 2098 С фигурная медь 110мм-золото',
    'Ручка д/пластикового окна УСИЛЕННАЯ',
    'Ручка оконная квадратная малая золото (100/600)',
    'Ограничитель д/пластикового окна -метал  белый',
    'завертка оконная Angelaмат лат Palladium',
    'Комплект по уходу за окнами',
    'Ручка оконная Apecs WH-0042-AC',
    'Ручка оконная Apecs WH-0031-AC',
    'Завертка оконная РО-1 (серебро)',
    'Ручка оконная Apecs WH-0042-CR',
    'Ручка оконная квадратная малая хром (60/600)',
    'ручка завертка врезная  Р-1\Р-2 Цинк (оконная)',
    'Завертка-ручка оконная Р1 белая Металлист',
    'Ручка балк двух-няя узкая-обычная с ключом ФАБРИКА ЗАМКОВ WHN ET с ключом (30)',
    'Замок оконный ЗР-2-2 Металлист',
    'Завертка форточная ЗФ1 Металлист',
    'Ответная планка Apecs PB-2801-CR хром (к замку 2800)',
    'Ответная планка 77303',
    'Ответная планка 221',
    'Ответная планка S0045 W прямая',
    'Ответная планка S0045 G прямая',
    'Ответная планка к 12.11 Гардиан',
    'Ответная планка 4.01.002',
    'Ответная планка S0045 CR прямая',
    'Ответная планка к 25.12 Гардиан',
    'Ответная планка к 10.11 Гардиан',
    'Ответная планка 2.501 к замкам 05.01, 05.03, 05.17',
    'Ответная планка к 21.12 Гардиан',
    'Ответная планка к 30.12 Гардиан',
    'Ответная планка 80105',
    'Ответная планка к 10.01 Гардиан',
    'Ответная планка к 30.15 Гардиан',
    'Ответная планка AVERS BP-5004 NIS',
    'Ответная планка Apecs PB-1425-CR хром',
    'Ответная планка AVERS BP-5003 NIS',
    'Ответная планка S0045 G/изогн.',
    'Ответная планка Аpecs РВ- 5200- СR хром',
    'Ответная планка S0045 CR изогн',
    'Ответная планка S0045 OL прямая',
    'Ответная планка Аpecs РВ- 5700- СR хром',
    'Ответная планка 2.402 к замкам 04.02',
    'Ответная планка Apecs PB-2800-G золото',
    'Ответная планка 2.502 к замкам 05.02, 05.04',
    'Ответная планка  к замку 30.11',
    'Ответная планка к 32.11 Гардиан',
    'Ответная планка к 32.01 Гардиан',
    'Ответная планка к 852.002',
    'Ответная планка к 8.02.002',
    'Ответная планка к 9.02.002',
    'Ответн.пл. Аpecs РВ- 4700- СR хром',
    'Регулируемая ответная планка для профильных дверей SP-004-R (230x30 мм)',
    'Ответная планка к 40.11 Гардиан',
    'Регулируемая ответная планка для профильных дверей SP-002-L (230x30 мм) (KBE)',
    'Регулируемая ответная планка для профильных дверей SP-001-U (190x22 мм)'
  ];
  let number = ports.length;
  // console.log(number);
  var i = 0;
  var ii = 0;
 
  // for (const url of urls) {
    
  //   // let urlafter = url.replace(/ /g, '%20');
    
  //   console.log(ii + 1);
  //   if (i > number - 1) {
  //     i = 0;
  //   }
  //   /**
  //    * ...каждый раз - с новым номером порта.
  //    */
  //   // console.log(await scrape(ports[i], urlafter));
  //   try {
  //     if (await scrape(ports[i], url) == '') {
  //       console.log('hyi');

  //       if (i > number - 1) {
  //         i = 0;
  //       } else {
  //         i++;
  //       }
        
  //       error('error');
  //     } else {
  //       i++;
  //       ii++;
  //       console.log('---------------------------------------------------------------------------------------------------------------------------------------------');
  //     }  
  //   } catch (e) {
  //     console.log(e);
  //     if (await scrape(ports[i], url) == '') {
  //       if (e == 'undefined') {
  //         if (i > number - 1) {
  //           i = 0;
  //         }
  //         await scrape(ports[i], url);
  //       } else {
  //         i++;
  //         await scrape(ports[i], url);
  //       }
  //     }

  //   }
    
    
  // }


  for (const [i, value] of urls.entries()) {
    await scrape(ports[i % ports.length], value);
    console.log('---------------------------------------------------------------------------------------------------------------------------------------------');
  }
 
}

main();